{
  "English": "English",
  "Japanese": "Japanese",

  "岸研究室 | ソフトウェア工学": "Kishi Lab | Software Engineering",
  "早稲田大学 創造理工学部 経営システム工学科 / 早稲田大学大学院 創造理工学研究科 経営システム工学専攻": "Waseda University, Creative Science and Engineering, Department of Industrial and Management Systems Engineering",
  "我々は、ソフトウェア工学を軸に、様々な研究に日々取り組んでいます。": "We are working on various research daily on the basis of software engineering.",
  "分野はSPL、テスト、検証を中心に、対象はネイティブアプリやモダンWeb、IoTなど多岐に渡ります。": "Our field is centered on SPL, testing and verification. The target covers a wide range of native applications, modern web applications, and IoT.",
  "詳細や過去のNews": "Details and Past News",
  "こちら": "Click Here!",

  "ソフトウェア工学を軸に研究を行なっています。": "We study a wide range of fields centered on software engineering.",

  "岸 知二": "Tomoji KISHI",
  "教授": "/ Professor",
  "Tomoji KISHI": "岸 知二",
  "大規模な社会インフラからモバイル機器まで、日常生活を支えるあらゆるシステムが情報技術によって実現されています。その情報技術を支えるのがソフトウェアです。ソフトウェア工学は、変化の激しいビジネス・技術環境の中、ソフトウェアをどう作り、どう使い、どう進化させていくかを研究する分野です。本研究室では、モデリング技術を活用したソフトウェアデザインを中心テーマに、ソフトウェア工学の様々な問題に取り組んでいます。ソフトウェアをどういうアーキテクチャで作るか、類似したソフトウェアをどう効果的に作るか、作ったソフトウェアの正しさをどう確認するか、そうした問題に対して、様々な技術を適用してチャレンジしています。": "From large-scale social infrastructure to mobile equipment, every system that supports daily life is realized by information technology. Software supports this information technology. Software engineering is a field that studies how to make software, how to use it, and how to evolve in a changing business environment / technology environment. In our laboratory, we are addressing various problems of software engineering, centering on software design utilizing modeling technology. We are challenging various architectures to deal with such problems as how to make software with architecture, how to make similar software effectively, how to check the correctness of the software we made, and so on.",
  "1980年　京都大学 工学部情報工学科 卒業": "1980: Graduated from Department of Information Engineering, Faculty of Engineering, Kyoto University",
  "1982年　京都大学大学院 工学研究科情報工学専攻 修士課程 修了": "1982: Graduated from graduate School of Engineering, Kyoto University Master's Program in Information Engineering",
  "1982年　日本電気 入社": "1982: Joined NEC",
  "1986年　Carnegie Mellon University visiting scientist": "1986:　Carnegie Mellon University visiting scientist",
  "2002年　北陸先端科学技術大学院大学 情報科学研究科　博士後期課程 修了": "2002: Completion of doctoral course at School of Information Science, Japan Advanced Institute of Science and Technology",
  "2003年　北陸先端科学技術大学院大学 情報科学研究科　着任": "2003: Joined the School of Information Science, Japan Advanced Institute of Science and Technology",
  "2009年　早稲田大学 創造理工学部経営システム工学科　教授": "2009: Waseda University Professor of Management System Engineering Department of Creative Science and Engineering Department",

  "岸研究室は充実した設備が整っています": "Kishi laboratory has plenty of fulfilling equipment.",
  "PC/Tablet(デバイス)": "PC/Tablet",
  "Equipments(周辺機器等)": "Equipments",
  "Books(書籍)": "Books",
  "Others(その他)": "Others",
  "WindowsOSを搭載したデスクトップPCやSurface Bookを含むノートPCをはじめ、少数ですが、iMacや最新のMacBook ProなどのMacOSも配置しています。また、作業効率向上のため、多数のディスプレイを用意しています。最近はiPadなどのタブレットも導入しました。": "We have many desktop PCs with Windows OS and laptops such as the latest Surface Book. We also have a few MacOS such as iMac and the latest MacBook Pro. In addition, we have a large number of displays to improve working efficiency. Recently, we also introduced a tablet such as iPad.",
  "岸研究室には、PC周辺機器を含め様々な機器が充実しています。大型TVをはじめ、3DプリンタやNAS、Apple TV、ワイヤレスディスプレイアダプターも用意しています。": "Kishi laboratory has various fulfilling equipment including PC peripheral equipment. We also have large-format TVs, 3D printers and NAS, Apple TV, wireless display adapters.",
  "情報システムやソフトウェア工学関連の書籍をはじめ、プログラミング入門書からO'Reillyの専門書まで技術書が大変充実しています。": "We have plenty of technical books, from introductory books on programming to professional books on O'Reilly.",
  "加湿・空気清浄機やコーヒーメーカー、冷蔵庫、電子レンジに加えて、温度調整と自動保温を兼ね添えたスマートケトルなどまで充実した備品を用意しております。": "In addition to humidifier / air purifiers, coffee makers, refrigerators and microwave ovens, we also have extensive furniture such as smart kettle that combines temperature control and automatic heat retention. The whole room of the laboratory is also beautiful in a spacious space.",

  "研究を中心に様々な活動を行なっています。": "We are doing various activities centering on research.",

  "ゼミ": "Research Seminar",
  "毎週水曜日に全体ゼミ、毎週月曜日に修士ゼミを行なっております。全体ゼミではゼミ生からの研究の進捗報告を主に行い、修士ゼミは輪講や課題に取り組みます。その他にも不定期で、B3ゼミや卒論修論に向けた直前の集中ゼミなども行われております。プログラミングに関心はあるけどまだ自信がないという方も、B3が入った秋学期はB3向けに修士学生がJavaゼミが開き、学ぶことができるので安心してください。主に取り組んでいる研究トピックは": "We hold a research seminar every Wednesday and a master 's research seminar every Monday. In the whole research seminar, our students will mainly report the progress of the research. In master's research seminar, master's students work on lectures and tasks. In addition, we also occasionally do B3 seminars, Java seminars by master's students for B3, intensive seminars just prior to graduation thesis and study. Our research topics mainly working on are",
  "こちら。": "Here!",
  "合宿": "Seminar Camp",
  "合宿は、年に２回、夏と秋に行なっております。夏合宿は春の発表に向けてあと半年どう研究を深めていくかを決める大事な合宿となっております。秋合宿は、B3が秋学期から新しく入るため、親交を深めるためにも行なっております。そこでB3の方も先輩方とも仲良くなれます。": "We hold seminar camps twice a year, in summer and autumn. The summer camp is an important camp that decides how to deepen research in the next six months for spring presentation. For B3 to enter the fall semester newly, the autumn camp is being held to deepen friendship. So B3 students can get along with their seniors.",
  "修論・卒論審査会": "Master's and Bachelor's thesis review",
  "1月に修士論文・卒業論文を提出したあと、2月にその審査会が行われます。学生が長い期間をかけて真剣に取り組んだ研究成果を発表することができるとても大切な機会です。歴代の修論・卒論のリストは": "We submit master's thesis / bachelor thesis in January. After that, presentation examination of the paper is held in February. It is a very important opportunity for students to present their research achievements seriously taken over a long period of time. The title list of the master thesis and the bachelor thesis is",
  "Research(対外発表)": "Research",
  "岸研究室では、教授・学生共に、対外発表や論文投稿も行なっております。ポスター発表、全国大会の発表、研究会での発表をはじめ、様々な機会で研究成果を発表し、受賞経験もあります。詳細は": "At the Kishi Laboratory, both professors and students are presenting presentations on external conferences and papers. We are publishing research results at various opportunities including poster presentation, presentation presentation at national convention and presentation at research meeting. Some of us have also won several awards. Details are",
  "Education(教育活動)": "Education",
  "2017年夏に岸研究室として初めて、早稲田大学理工学術院主催の小中学生の科学実験教室「ユニラブ」にプログラミング教育の分野で出展しました。学生が中心となって企画し、小学生を対象に、教育業界から注目が集まるビジュアルプログラミングScratchを用いて、ゲーム作りを行いました。教室は大盛況で子供達にも満足していただくことができました。": "In the summer of 2017, Kishi Laboratory exhibited for the first time at the scientific experiment seminar \"Unilab\" of elementary and junior high school students organized by Waseda University. Our students organized a programming seminar for one of those seminars. We held a seminar on game making for elementary school students using Visual Programming 's Scratch which attract attention from the education industry. The seminar was a great success. We were able to satisfy our children.",
  "Learning(学習活動)": "Learning",
  "岸研究室では、様々な学習活動・プログラムにも積極的に参加しております。毎年、情報技術人材の育成・教育プログラムであるenPit夏合宿に参加しております。また、知見をより深めるため、2016年から情報処理学会 ソフトウェア工学研究会が主催するICSE勉強会にも参加し、学生が発表を行なっております。": "Kishi laboratory actively participates in various learning activities and programs. Every year, I participate in enPit summer training camp of information technology education program. Also, in order to deepen our knowledge, students participate in the ICSE study group sponsored by SIGSE of IPSJ from 2016 and the students are making presentations.",
  "Class(担当講義)": "Class",
  "教授は本大学にて、主に以下の講義を担当しております。": "Professor is mainly in charge of the following classes at Waseda University. Those who belong to Kishi laboratory are sure to attend, but we can also attend non-Kishi laboratory so please consider it.",
  "情報システム開発演習": "Exercise on information system development",
  "情報システム": "Information system",
  "ソフトウェア工学": "Software Engineering",
  "ソフトウェアマネジメント": "Software management",
  "情報システム特論(修士)": "Advanced Information System (Master)",
  "ソフトウェアデザイン特論(修士)": "Advanced Software Design (Master)",
  "教授は書籍等の出版にも携わっています。以下、主要著書です。": "Professor is also involved in publications such as books. Below is the main book.(Japanese publications are written in Japanese titles below)",
  "[共著]オブジェクト指向最前線―情報処理学会OO’97シンポジウム, 朝倉書店(1997)": "[Co-author]オブジェクト指向最前線―情報処理学会OO’97シンポジウム, 朝倉書店(1997)",
  "[共著]ソフトウェアアーキテクチャ, 共立出版(2005)": "[Co-author]ソフトウェアアーキテクチャ, 共立出版(2005)",
  "[共著]ソフトウェア工学の基礎ⅩⅣ, 近代科学社(2007)": "[Co-author]ソフトウェア工学の基礎ⅩⅣ, 近代科学社(2007)",
  "[共著]ソフトウェアエンジニアリング最前線〈2009〉, 近代科学社(2009)": "[Co-author]ソフトウェアエンジニアリング最前線〈2009〉, 近代科学社(2009)",
  "[共著]Applied Software Product Line Engineering, CRC Press(2010)": "[Co-author]Applied Software Product Line Engineering, CRC Press(2010)",
  "[共著]ソフトウェア工学, 近代科学社(2016)": "[Co-author]ソフトウェア工学, 近代科学社(2016)",

  "主な研究分野はテスト/モデル検査/SPLです。": "Our focused research areas are SPL, Testing and Model Checking.",
  "Testing(テスト)": "Testing",
  "Model Checking(モデル検査)": "Model Checking",
  "SPL(ソフトウェアプロダクトライン)": "SPL(Software Product Line)",
  "Other Technologies(その他の分野)": "Other Technologies",
  "近年、ソフトウェア開発の期間は短くなってきています。 その中で品質を確保するために「ソフトウェアテスト」の重要性は大きくなっています。 そのようなソフトウェアテストはソフトウェア工学の一部であり欠かかせない分野となっています。近年はWebアプリケーションを対象としたテストなどについても研究を行なっています。": "In recent years, the period of software development is getting shorter. Among them, the importance of software test is growing to ensure quality. Such software testing is a part of software engineering and is an indispensable field. In recent years, we are also conducting research on tests targeting Web applications.",
  "ソフトウェア設計の正しさを確認するためには手作業では不十分かつ非効率です。例えばモデル検査技術と呼ばれる形式手法を適用することで、信頼度向上かつより少ない人手で設計検証を行えると期待できます。そうした手法を実際のソフトウェア開発において活用するための手法などについて研究しています。": "It is not enough and inefficient in the hand in order to check the correctness of the software design has been described in a model such as UML. For example, by applying the scientific technique called model checking techniques, It will be expected to carry out the design verification in a more reliable high and less manpower. The methods and environments for the effective use and have been studied in an actual software development such a scientific approach.",
  "一定の共通性を持った製品群を全体最適の観点から捉え、戦略的・体系的に開発するアプローチがソフトウェアプロダクトライン開発です。その実現には、製品群への要求事項を体系的に整理し、それを受け止める適切なソフトウェアアーキテクチャを設計し、 それを踏まえた再利用資産を開発、管理することが必要となります。こうした高度な体系化の手法やそのための技術について研究しています。": "The approach which catches product aggregate with the fixed common characteristic from the angle of the whole suitability and develops it strategically systematically is software product linear development. In its realization , to organize the requirements of the product group in a systematic manner , and to design the appropriate software architecture for receiving it, Development of reusable assets in light of it , you will need to be managed. We study these highly codified technique and for its technology .",
  "岸研究室では主な３つに加えて様々な分野に取り組んでいます。近年盛んになっているIoT、機械学習、モダンWeb、モバイルアプリ、VR/AR、ビジュアルプログラミングなどの最新技術についても取り組んでおります。": "Kishi laboratory is working on various fields in addition to the main three. I am also researching the latest technologies such as IoT, Machine Learning, Modern Web, Mobile Application, VR / AR, Visual Programming, etc. which have become popular recently.",

  "→ 修論・卒論はこちら": "→ Master's / Bachelor's thesis is here",
  "-修論・卒論リスト-": "-List of Master's / Bachelor's thesis- (Only Japanese Title)",
  "→ 論文や対外発表などはこちら": "→ Click here for papers and academic presentations",

  "東京都新宿区大久保３−４−１": "3-4-1 Okubo Shinjuku-ku, Tokyo",
  "早稲田大学　西早稲田キャンパス": "Waseda University Nishiwaseda Campus",
  "51号館14階 (教授室：14-10A, 学生居室：14-08)": "14th floor of building 51(Professor's Room: 14-10A, Students Room: 14-08)",
  "東京メトロ副都心線 西早稲田駅 出口3（早大理工方面口）直結": "Direct connection to Exit 3 of Nishi-Waseda Station, Tokyo Metro Fukutoshin Line",
  "JR山手線 高田馬場駅 より 徒歩15分": "15 minutes from Takadanobaba Station(JR Yamanote Line) on foot.",
  "東京メトロ東西線 高田馬場駅 より 徒歩15分": "15 minutes from Takadanobaba Station(Tokyo Metro Tozai Line) on foot.",
  "西武新宿線 高田馬場駅 より 徒歩15分": "15 minutes from Takadanobaba Station(Seibu Ikebukuro Line) on foot.",
  "岸 知二 (Tomoji KISHI)": "Tomoji KISHI (岸 知二)"

}
