// 注意：OB卒業生は ob.ts の該当年度に必ず移すこと！

// member情報はここをedit
export const STUDENTS: any = {
  b3: [
      '磯貝日々輝',
      '小田切伶旺',
      '上司千尋',
      '桑山諒夕',
      '小味渕裕暉',
      '坂井大成',
      '三井理沙',
      '宮本照隆',
    ],
    b4: [
      '井村悠成',
      '加藤早莉',
      '小山大揮',
      '里見政信',
      '南木将宏',
      '難波貴司',
      '波田野愛理',
      '星野隆太',
      '松田彩那',
      '安田千夏'
    ],
    m1: [
      '秋本裕史',
      '磯上雄人',
      '佐藤孝一',
      '西野航平',
      '遊佐健太郎',
    ],
    m2: [
      'エンジジュン',
      'シュユンカン',
      '中村将仁',
      '矢島大嗣'
    ],
    d1: [],
    d2: [],
    d3: [],
    pro: [
      '岸 知二'
    ]
  };
