// member情報はここをedit
export const STUDENTS: any = {
  b3: [
    '江崎信',
    `岡本拓真`,
    `岸名敦司`,
    `西優吾`,
    `不藤奈々`,
    `溝渕絋平`,
    `山本真琴`,
    `渡辺太朗`,
    `和藤翔哉`,
    ],
    b4: [
      '堤真聖',
      '颯波賢治',
      '関谷響',
      '田中秀和',
      '田畑陸斗',
      '中込敦皓',
      '東礼次郎',
      '宮嵜開望',
      '山野太暉',
      '吉城尚哉',
    ],
    m1: [,
      '齋藤優',
      '平原理彩',
      '森優津希',
      '朱勇',
    ],
    m2: [
    '里見政信',
    '張超群',
    '堀内奎佑',
    '李健翔',
    ],
    d1: [],
    d2: [],
    d3: [],
    pro: [
      '岸 知二'
    ]
  };
