// member情報はここをedit
export const STUDENTS: any = {
  b3: [
    '石川拓人',
    `内谷郁哉`,
    `小野稜馬`,
    `木村晃成`,
    `草野正浩`,
    `佐藤柊平`,
    `藤田智史`,
    `堀内奎佑`,
    `宮地俊輔`,
    `吉村裕一`,
    `李健翔`,
    ],
    b4: [
      '磯貝日々輝',
      '小田切伶旺',
      '上司千尋',
      '桑山諒夕',
      '内藤裕暉',
      '坂井大成',
      '三井理沙',
      '宮本照隆',

    ],
    m1: [,
      '小山大揮',
      '里見政信',
      'ヨウウキン',
    ],
    m2: [
    '秋本裕史',
    '磯上雄人',
    '佐藤孝一',
    '西野航平',
    '遊佐健太郎',
    ],
    d1: [],
    d2: [],
    d3: [],
    pro: [
      '岸 知二'
    ]
  };
