// member情報はここをedit
export const STUDENTS: any = {
  b3: [
      '井村悠成',
      '加藤早莉',
      '小山大揮',
      '里見政信',
      '難波貴司',
      '波田野愛理',
      '星野隆太',
      '松田彩那',
      '安田千夏'
    ],
    b4: [
      '植村一志',
      '秋本裕史',
      '磯上雄人',
      '内ケ島章太',
      '北村陽佳',
      '佐藤孝一',
      '中村美佑',
      '山口直輝',
      '遊佐健太郎'
    ],
    m1: [
      'エンジジュン',
      'シュユンカン',
      '中村将仁',
      '矢島大嗣'
    ],
    m2: [
      '大嶋乃斗',
      '木村健太',
      '田中颯',
      'チョウカンウ'
    ],
    d1: [],
    d2: [],
    d3: [],
    pro: [
      '岸 知二'
    ]
  };
